Revit 2024 API
UIApplication.ActiveUIDocument Property
Provides access to an object that represents the currently active project.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual UIDocument ActiveUIDocument { get; }
Visual Basic
Public Overridable ReadOnly Property ActiveUIDocument As UIDocument
	Get
Visual C++
public:
virtual property UIDocument^ ActiveUIDocument {
	UIDocument^ get ();
}
Remarks
External API commands can access this property in read-only mode only! The ability to modify the property is reserved for future implementations.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException | Thrown when attempting to modify the property.
See Also
UIApplication Class
Autodesk.Revit.UI Namespace